export default async function before(m, { conn, bot }) {

  const owner = "0906024672@s.whatsapp.net";

  const triggers = {
    "السلام عليكم": ["وعليكم السلام", "وعليكم السلام ورحمة الله", "أهلاً وسهلاً"],
    "تست": ["تست شغال", "تم", "تست وصل"],
    "هلا": ["هلا وغلا", "يا هلا بيك", "نورت"],
    "باي": ["مع السلامة", "باي باي", "الله يحفظك"],
    "صباح الخير": ["صباح النور", "صباح الورد", "صباح الفل"],
    "مساء الخير": ["مساء النور", "مساء الورد", "مساء الجمال"],
    "مساء النور": ["مساء الورد", "مساء الفل", "الله ينور عليك"],
    "كيفك": ["تمام الحمدلله", "بخير وانت؟", "الحمدلله بخير"],
    "شنو اخبارك": ["تمام", "كلو تمام", "الحمدلله بخير"],
    "وينك": ["أنا هنا", "معاك دايمًا", "في الخدمة"],

    // ردود الحب
    "بحبك": [
      "وأنا كمان بحبك",
      "الله يديم المحبة بيننا",
      "وأنا أحبك أكثر",
      "تسلم يا غالي"
    ]
  };

  const text = (m.text || "").toLowerCase();

  const replies = triggers[m.text];
  if (replies) {
    const ranReply = replies[Math.floor(Math.random() * replies.length)];
    return m.reply(ranReply);
  }

  if (text.includes("كسم")) {
    return conn.sendMessage(m.chat, {
      text: "تم رصد كلمة غير لائقة وتم إشعار المؤسس",
      mentions: [owner]
    }, { quoted: m });
  }

  return false;
}
