export default async function before(m, { conn, bot }) {

  const owner = "0906024672@s.whatsapp.net";

  const triggers = {
    "السلام عليكم": ["وعليكم السلام", "وعليكم السلام ورحمة الله", "أهلاً وسهلاً"],
    "تست": ["تست شغال", "تم", "تست وصل"],
    "هلا": ["هلا وغلا", "يا هلا بيك", "نورت"],
    "باي": ["مع السلامة", "باي باي", "الله يحفظك"],
    "صباح الخير": ["صباح النور", "صباح الورد", "صباح الفل"],
    "مساء الخير": ["مساء النور", "مساء الورد", "مساء الجمال"],
    "مساء النور": ["مساء الورد", "مساء الفل", "الله ينور عليك"],
    "كيفك": ["تمام الحمدلله", "بخير وانت؟", "الحمدلله بخير"],
    "شنو اخبارك": ["تمام", "كلو تمام", "الحمدلله بخير"],
    "وينك": ["أنا هنا", "معاك دايمًا", "في الخدمة"],

    // ❤️ ردود الحب
    "بحبك": ["وأنا كمان بحبك", "الله يديم المحبة", "وأنا أحبك أكثر"],
    "احبك": ["وأنا أحبك 🤍", "محبة متبادلة", "الله يخليك"],

    
    // 🤖 معلومات
    "مين انت": ["أنا بوت اسمي توجي ", "أنا مساعدك توجي"],
    "مين صنعك": [`المطور: ${owner}`],
    "من المطور": [`رقم المطور: ${owner}`],

    // 🔥 طلبك
    "بوت": ["بوت في عينك اسمي توجي"],
    "توجي": ["عيوني 🤍"],

    // 🙌 ردود عامة
    "تمام": ["تمام", "حلو🙂"],
    "اوكي": ["تمام ", "أوكي "],
    "شكرا": ["العفو 🤍", "عادي ولو"],
    "شكراً": ["العفو 🤍", "ولا يهمڪ💋"],

    // 😴 حالات
    "تعبان": ["سلامتك 😔", "خذ راحة"],
    "زهجان": ["تعال نتونس", "الزهج عام🙂💔"]
  };

  const text = (m.text || "").toLowerCase();

  // يخلي الرد يشتغل حتى لو الكلمة داخل جملة
  const key = Object.keys(triggers).find(k => text.includes(k));
  const replies = triggers[key];

  if (replies) {
    const ranReply = replies[Math.floor(Math.random() * replies.length)];
    return m.reply(ranReply);
  }

  // 🚫 فلتر سب
  if (text.includes("كسم")) {
    return conn.sendMessage(m.chat, {
      text: "تم رصد كلمة غير لائقة وتم إشعار المؤسس",
      mentions: [owner]
    }, { quoted: m });
  }

  return false;
}
