const txt = `
اللَّهُمَّ إِنِّي أَسْأَلُكَ رِضَاكَ وَالْجَنَّةَ
وَأَعُوذُ بِكَ مِنْ سَخَطِكَ وَالنَّارِ

╭────⟞ʚɞ⟝────╮
┃    『 𝐓𝐎𝐉𝐈 𝐁𝐎𝐓 』
╰────⟞ʚɞ⟝────╯
┃ ⌯︙1 ↬ قسم التحميل      ʚɞ
┃ ⌯︙2 ↬ قسم المجموعات    ʚɞ
┃ ⌯︙3 ↬ قسم الملصقات     ʚɞ
┃ ⌯︙4 ↬ قسم المطورين     ʚɞ
┃ ⌯︙5 ↬ قسم الأمثلة       ʚɞ
┃ ⌯︙6 ↬ قسم الأدوات      ʚɞ
┃ ⌯︙7 ↬ قسم البحث        ʚɞ
┃ ⌯︙8 ↬ قسم المشرفين     ʚɞ
┃ ⌯︙9 ↬ قسم الألعاب      ʚɞ
┃ ⌯︙10 ↬ قسم الجيف       ʚɞ
┃ ⌯︙11 ↬ قسم البنك       ʚɞ
┃ ⌯︙12 ↬ قسم الذكاء الاصطناعي ʚɞ
┃ ⌯︙13 ↬ قسم البوتات الفرعية ʚɞ
┃ ⌯︙14 ↬ قسم معلومات البوت ʚɞ
┃ ⌯︙15 ↬ قسم أقسام أخرى   ʚɞ
╰────⟞ʚɞ⟝────╯

✦ الرد برقم القسم لعرض الأوامر ✦
𝐓𝐎𝐉𝐈 𝐈𝐍 🏮`;

